#===============================================================
#                CHHD301-Biostatistics
#===============================================================
# INSTRUCTOR : Dr. Wiriya Mahikul
# TITLE      : Lecture 6 - Sampling Distribution
#===============================================================


##=============== Sampling distribution of the sample mean ====================

## หน้า 20
# The length of skull among people in the community have a normal distribution with mean 186.5 mm 
# and standard deviation 17.2 mm. If we are sampling 20 people in this community, what is the probability of the sample
# mean of the skull’s length greater than 195 mm?

# P(x̄ > 195)
pnorm(195, mean = 186.5, sd = 17.2/sqrt(20), lower.tail = FALSE, log.p = FALSE)


## หน้า 22
# ความยาวลําตัวของทารกที่คลอดตามกําหนดเวลา (9 เดือน) ในชุมชน
# แห่งหนึ่งมีการแจกแจงโดยประมาณแบบปกติด้วยค่าเฉลี่ย 50 ซม.
# ถ้าเลือกตัวอย่างทาระที่คลอดตามกําหนดในชุมชนแห่งนี้มา 20 คน
# คํานวณส่วนเบี่ยงเบนมาตรฐานของตัวอย่างได้ 1.24 ซม. จงหาความ
# น่าจะเป็นที่จะได้ความยาวเฉลี่ยของทารกกลุ่มนี้มากกว่า 50.48 ซม.

##pnorm(50.48, mean = 50, sd = 1.24/sqrt(20), lower.tail = FALSE, log.p = FALSE)
#t
#P(x̄ > 50.48)
pt((50.48-50)/(1.24/sqrt(20)), df=19, lower.tail = FALSE, log.p = FALSE)



## หน้า 27
# ปริมาณธาตุเหล็กในเลือดของคนที่มีสุขภาพดีควรจะมีค่าเฉลี่ยที่ 120 ไมโครกรัมต่อ 100 มล.
# และส่วนเบี่ยงเบนมาตรฐาน 15 ไมโครกรัมต่อ 100 มล. ถ้าเลือกตัวอย่างคนที่มีสุขภาพดีในเมืองแห่งหนึ่งมา 60 คน 
# จงหาความน่าจะเป็นที่ค่าเฉลี่ยตัวอย่างของปริมาณ ธาตุเหล็กในเลือดจะอยู่ระหว่าง 114 ถึง 122 ไมโครกรัมต่อ 100 มล.

#P(114 ≤ x̄ ≤ 122 )
pnorm(122, mean = 120, sd = 15/sqrt(60), lower.tail = TRUE, log.p = FALSE)-pnorm(114, mean = 120, sd = 15/sqrt(60), lower.tail = TRUE, log.p = FALSE)


## หน้า 29
# The average male drinks 2.0 liters of water per day 
# when active outdoors with a standard deviation of 0.7 liters. 
# You are planning a full day nature trip for 50 men who will bring 110 liters of water. 
# What is the probability that you will run out of water?

#P(x̄ > 2.2)
pnorm(2.2, mean = 2, sd = 0.7/sqrt(50), lower.tail = FALSE, log.p = FALSE)



##=============== Distribution of sample proportion ====================

## หน้า 33
# จากรายงานการสํารวจภาวะโภชนาการปี1999-2000 ใน USA
# ระบุว่า ร้อยละ 31 ของประชากรอายุ 20-74 ปีมีภาวะเป็นโรคอ้วน
# (BMI>30.0) ถ้าเลือกตัวอย่างประชากร 20-74 ปีมาอย่างสุ่ม 150 คน
# จงหาโอกาสที่จะพบผู้มีภาวะเป็นโรคอ้วนเกินกว่าร้อยละ 40

# P(p > 0.4)
pnorm((0.4-0.31)/sqrt(0.31*0.69/150), lower.tail = FALSE, log.p = FALSE)


##=================================##
##  Distribution of the difference ##
##    between two sample means     ##
##=================================##

## หน้าที่ 38
# ระยะเวลาที่ใช้ในการเดินทางไปตรวจเยี่ยมของเจ้าหน้าที่จากสถานีอนามัยถึงบ้านคนไข้ที่ป่วยเป็นโรคมาเลเรีย
# ใช้เวลาเฉลี่ย 45 นาที และมีส่วนเบียงเบนมาตรฐาน 15 นาที ระยะเวลาที่ใช้ในการเดินทางไป
# ตรวจเยี่ยมของเจ้าหน้าที่จากสถานีอนามัยถึงบ้านคนไข้ที่ป่วยเป็นโรคท้องร่วงใช้เวลาเฉลี่ย 30 นาที มีส่วนเบี่ยงเบนมาตรฐาน 20 นาที
# ถ้าเจ้าหน้าที่สถานีอนามัยได้ทำการส่มบ้านที่จะไปตรวจเยี่ยมคนไข้มาเลเรีย 35 บ้านและเลือกบ้านที่จะไปตรวจเยี่ยมคนไข้ท้องร่วง 40 บ้าน
# จงหาความน่าจะเป็นที่เวลาที่ใช้ตรวจเยี่ยมคนไข้ทั้ง 2 โรคโดย เฉลี่ยจะแตกต่างกันตั้งแต่ 13 นาทีขึ้นไป

# P(x̄1 − x̄2 ≥13)
pnorm(13, mean = 45-30, sd = sqrt((15^2)/35+(20^2)/40), lower.tail = FALSE, log.p = FALSE)



##====================================##
##  Distribution of the difference    ##
##   between two sample proportion    ##
##====================================##

## หน้า 42
# จากรายงานของกรมแรงงานกระทรวงมหาดไทย พ.ศ. 2545 ระบุว่า ร้อยละ 21 ของแรงงาน
# ในภาคใต้มีการทำประกันสุขภาพด้านสายตา และ ร้อยละ 13 ของแรงงานในภาคตะวันออกเฉียงเหนือ
# มีการทำประกันสขภาพสขภาพด้านสายตา ถ้าสู่มเลือกผู้ใช้แรงงานในภาคตะวันออกเฉียงเหนือ 130 คน
# และสุ่มเลือกผู้ใช้แรงงานในภาคใต้ 120 คน อย่างเป็นอิสระต่อกัน จงหาความน่าจะเป็นที่จะได้ความ
# แตกต่างของร้อยละผู้ใช้แรงงานทั้ง 2 ภาคที่ทำประกันสุขภาพด้านสายตามีค่าไม่เกินร้อยละ 4

# P(p1 − p2 <0.04)
pnorm(0.04, mean = 0.21-0.13, sd = sqrt(0.21*0.79/120+0.13*0.87/130), lower.tail = TRUE, log.p = FALSE)

1-pnorm(-0.04, mean = 0.13-0.21, sd = sqrt(0.21*0.79/120+0.13*0.87/130), lower.tail = TRUE, log.p = FALSE)



##=============== Quiz: Sampling distributions ====================

## Quiz 01
# ส่วนสูงของคนในหมู่บ้านแห่งหนึ่ง มีการแจกแจงปกติ มีค่าเฉลี่ย 165 
# และส่วนเบี่ยงเบนมาตรฐาน 12 เซนติเมตร ถ้าเลือกคนในหมู่บ้านแห่งนี้มา 20คน
# จงหาความน่าจะเป็นที่ค่าเฉลี่ยส่วนสูงน้อยกว่า 167 เซนติเมตร

pnorm(167, mean = 165, sd = 12/sqrt(20), lower.tail = TRUE, log.p = FALSE)


## Quiz 02
# ปริมาณธาตุเหล็กในเลือดของคนที่มีสุขภาพดีควรจะมีค่าเฉลี่ยที่ 120 ไมโครกรัมต่อ 100 มล.
# และส่วนเบี่ยงเบนมาตรฐาน 15 ไมโครกรัมต่อ 100 มล. ถ้าเลือกตัวอย่างคนที่มีสุขภาพดีในเมืองแห่งหนึ่งมา 60 คน
# จงหาความน่าจะเป็นที่ค่าเฉลี่ยตัวอย่างของปริมาณธาตุเหล็กในเลือดจะอยู่ระหว่าง 110 ถึง 125 ไมโครกรัมต่อ 100 มล.

pnorm(125, mean = 120, sd = 15/sqrt(60), lower.tail = TRUE, log.p = FALSE)-pnorm(110, mean = 120, sd = 15/sqrt(60), lower.tail = TRUE, log.p = FALSE)


## Quiz 03
# ค่าเฉลี่ยผู้ชายดื่มน้ำต่อวัน 2 ลิตร เมื่อทำกิจกรรมนอกบ้าน ด้วยค่าส่วนเบี่ยงเบนมาตรฐาน 0.7 ลิตร
# ถ้าคุณวางแผนทั้งวันกับทีมเพื่อนผู้ชายอีก 50 คน และนำน้ำ 110 ลิตรไปทำกิจกรรม จงหาความน่าจะเป็นที่น้ำจะหมด

pnorm(2.2, mean = 2, sd = 0.7/sqrt(50), lower.tail = FALSE, log.p = FALSE)


## Quiz 04
# จากรายงานการสำรวจภาวะโภชนาการปี 1999-2000 ใน USA ระบุว่า ร้อยละ 31 
# ของประชากรอายุ 20-74 ปี มีภาวะเป็นโรคอ้วน (BMI>30.0) ถ้าเลือกตัวอย่างประชากร 
# 20-74 ปี มาอย่างสุ่ม 150 คน จงหาโอกาสที่จะพบผู้มีภาวะเป็นโรคอ้วนมากกว่าร้อยละ 32

pnorm((0.32-0.31)/sqrt(0.31*0.69/150), mean = 0, sd=1, lower.tail = FALSE, log.p = FALSE)


## Quiz 05
# ระยะเวลาที่ใช้ในการเดินทางไปตรวจเยี่ยมของเจ้าหน้าที่จากสถานีอนามัยถึง
# บ้านคนไข้ที่ป่วยเป็นโรคมาเลเรียใช้เวลาเฉลี่ย 45 นาที และมีส่วนเบี่ยงเบนมาตรฐาน 15 นาที
# ระยะเวลาที่ใช้ในการเดินทางไปตรวจเยี่ยมของเจ้าหน้าที่จากสถานีอนามัยถึงบ้านคนไข้ที่ป่วยเป็นโรคท้องร่วง
# ใช้เวลาเฉลี่ย 30 นาที มีส่วนเบี่ยงเบนมาตรฐาน 20 นาที ถ้าเจ้าหน้าที่สถานีอนามัยได้ทำการสุ่มบ้านที่จะ
# ไปตรวจเยี่ยมคนไข้มาเลเรีย 35 บ้านและเลือกบ้านที่จะไปตรวจเยี่ยมคนไข้ท้องร่วง 40 บ้าน
# จงหาความน่าจะเป็นที่เวลาที่ใช้ตรวจเยี่ยมคนไข้ทั้ง 2 โรค โดยเฉลี่ยจะแตกต่างกันตั้งแต่ 12 นาทีขึ้นไป 
pnorm(12, mean = 45-30, sd = sqrt((15^2)/35+(20^2)/40), lower.tail = FALSE, log.p = FALSE)
