#===============================================================
#                CHHD301-Biostatistics
#===============================================================
# INSTRUCTOR : Dr. Wiriya Mahikul
# TITLE      : Lecture 11 - Hypothesis Testing [Two Population]
#===============================================================



library(TeachingDemos)
library(DescTools)


##============================ Tests for Two Population Mean ============================

## หน้า 22
# จากการประเมินผลของโปรแกรมควบคุมน้ำหนัก A และ B ใน ประชากร 
# พบว่าส่วนเยงเบนมาตรฐานของน้ำหนักที่ลดลงของโปรแกรม A และโปรแกรม B 
# เท่ากับ 0.5 และ 1 กิโลกรัม ตามลำดับถ้าทำการสู่มตัวอย่างกลุ่มที่เข้าร่วมโปรแกรม A 
# และ B กลุ่มละ 30 คน ได้ข้อมลดังนี้ กล่ม A ค่าเฉลียของน้ำหนักที่ลดลง 2.2 กิโลกรัม
# กลุ่ม B ค่าเฉลี่ยของน้ำหนักที่ลดลง 2.3 กิโลกรัม จากข้อมลสามารถสรุปได้หรือไม่ว่า 
# น้ำหนักเฉลี่ยที่ลดลง ทั้ง 2 กลุ่มแตกต่างกันที่ระดับนัยสำคัญ 0.05

pnorm(-0.4898)*2
pnorm(0.4898)


z.test(2.2-2.3,mu=0,sd=sqrt(0.5^2/30+1^2/30),alternative = "two.sided",conf.level = 0.95)



## หน้า 25
# นักวิจัยผู้หนึ่งต้องการเปรียบเทียบระยะเวลาที่ใช้ในการรักษา ตัวอย่างผู้ป่วย
# รายคน (นาที) ของแพทย์เฉพาะทาง 2 แผนก ในโรงพยาบาลแห่งหนึ่ง พบว่า
# แผนกที่ 1 ใช้เวลาเฉลี่ย 10.43 นาที และความแปรปรวน 2.10 นาที^2 จาก
# ตัวอย่าง 11 คน โดยแผนกที่ 2 ใช้เวลาเฉลี่ย 12.25 นาที และความแปรปรวน
# 2.56 นาที^2 จากตัวอย่าง 10 คน ถ้าระยะเวลาที่ใช้ในการรักษาของ 2 แผนก
# มีการแจกแจงแบบปกติโดยประมาณ และความแปรปรวนของระยะเวลาที่ใช้ใน
# การรักษาในประชากรไม่แตกต่างกัน จากข้อมูลสรุปได้หรือไม่ว่า ระยะเวลาที่ใช้
# ในการรักษาของแพทย์เฉพาะทาง แผนก แตกต่างกันที่ระดับนัยสำคัญ 0.1

##t-test equal variance
G1<-c(9.5,10.5,9.0,9.75,10.0,13.0,10.0,13.5,10.0,9.5,10.0)
mean(G1)
sd(G1)^2
G2<-c(12.5,9.5,13.5,13.75,12,13.75,12.5,9.5,12.0,13.5)
mean(G2)
sd(G2)^2
var.test(G1,G2,conf.level=0.9)
t.test(G1,G2,var.equal = TRUE,alternative = "two.sided",conf.level = 0.9)
pt(-2.73,df=19,lower.tail = TRUE)*2
pt(2.73,df=19,lower.tail = TRUE)
qt(0.05,df=19,lower.tail = FALSE)
qt(0.95,df=19,lower.tail = FALSE)


##====================================##
##           paired t-test            ##
##====================================##

## หน้า 32
# ในการศึกษาประสิทธิภาพของโปรแกรมการให้ความรู้เรื่องพิษภัยของบุหรี่ โดย
# พิจารณาจากคะแนนความรู้ของผู้เข้าร่วมโปรแกรม (0-100 คะแนน) สุ่มตัวอย่าง
# ผู้เข้าร่วมโปรแกรม จำนวน 12 คน และทำแบบทดสอบความรู้ก่อน-หลัง ซึ่งคะแนน
# มีการแจกแจงแบบปกติ โดยมีค่าส่วนเบี่ยงเบนมาตรฐานของผลต่างของความรู้
# ก่อน-หลังที่ 32.6817 คะแนน ได้ข้อมูลดังตารางต่อไปนี้ ...
# จากข้อมูลสรุปได้หรือไม่ว่าโปรแกรมการให้ความรู้เรื่องพิษภัยของบุหรี่ ทำให้
# ผู้เข้าร่วมโปรแกรมมีควาบุร์เพิ่มขึ้นที่ระดับนัยสำคัญ 0.05

before<-c(22,63.3,96.0,9.2,3.1,50.0,33.0,69.0,64.0,18.8,0,34.0)
after<-c(63.5	,91.5,	59,	37.8,	10.1,	19.6,	41,	87.8,	86,	55,	88,	40)
d<-after-before
d_bar<-sum(d)/12
d_bar
sd(d)
sd(d)^2
t.test(after,before,paired = TRUE, alternative ="greater",conf.level = 0.95 )
pt(1.9159,df=11,lower.tail = FALSE)
qt(0.05,df=11,lower.tail = FALSE)


##============================ Tests for Two Population Proportion ============================

## หน้า 38
# ตารางต่อไปนี้แสดงจํานวนนักเรียนชายและหญิงจากกลุ่มตัวอย่าง อายุ 6-12 ปี
# เพื่อศึกษาเกี่ยวกับภาวะทุพโภชนาการของเด็กในวัยเรียน

# กลุ่ม | จํานวน | จํานวนคนที่มีภาวะทุพโภชนาการ
# ชาย | 200 | 48
# หญิง |150 | 21

# จากตารางสรุปได้หรือไม่ว่า ภาวะทุพโภชนาการของเด็กวัยเรียนในกลุ่มเด็กผู้ชาย
# สูงกว่าในเด็กผู้หญิง ที่ระดับนัยสําคัญ 0.1

prop.test(x=c(48,21),n=c(200,150),alternative = "greater",conf.level = 0.9,correct = "FALSE")
z<-sqrt(5.4154)
z


##============================ Test for 2 variances (F - test) ============================

## หน้า 42
# ผู้ผลิตเครื่องมือแพทย์ต้องการทดสอบความคงทนของแบตเตอรี่ที่ใช้ในเครื่องวัดความดัน
# โลหิตของเครื่องรุ่นใหม่กับเครื่องรุ่นเดิม ผู้ผลิตเครื่องมือแพทย์ทำการวัดอายุของแบตเตอรี่
# ของเครื่องวัดความดันโลหิตทั้ง 2 รุ่น พบว่ามีอายของแบตเตอรี่ (สัปดาห์) มีการแจกแจง
# แบบปกติ โดยเครื่องร่นเก่ามีความแปรปรวนที่ 7.0727 สัปดาห์^2 และเครื่องรุ่นใหม่มีความ
# แปรปรวนที่ 9.6625 สัปดาห์^2 ดังรายละเอียดต่อไปนี้

# อายุของแบตเตอรี่รุ่นเก่า (สัปดาห์): 8, 9, 10, 12, 13, 10, 8, 7, 6, 5, 5
# อายุของแบตเตอรี่รุ่ นใหม่(สัปดาห์): 12, 14, 16, 23, 23, 17, 20, 21, 19, 19, 17, 16, 16, 16, 17, 21

# จากข้อมูลดังกล่าวสรุปได้หรือไม่ว่า ความแปรปรวนของอายุแบตเตอรี่ของ
# เครื่องวัดความดันโลหิต ของทั้ง 2 รุ่น แตกต่างกันที่ระดับนัยสําคัญ 0.1

new<-c(12,	14,	16,	23,	23,	17,	20,	21,	19,	19,	17,	16,	16,	16,	17,	21)
sd(new)^2
old<-c(8,	9,	10,	12,	13,	10,	8	,7	,6	,5,	5)
sd(old)^2

var.test(new,old,alternative = "two.side",conf.level = 0.9)
qf(0.05, df1=15, df2=10, lower.tail = FALSE)
qf(0.95, df1=15, df2=10, lower.tail = FALSE)




##================ Compute the analysis of variance (ANOVA) ============================

## หน้า 58
treat<-c(rep("trt1",10),rep("trt2",10),rep("trt3",10))
weight<-c(8,5,7,9,7,6,5,3,4,4,4,8,7,9,10,6,8,6,7,5,10,6,9,8,11,5,9,12,8,10)
data_xy<-data.frame(weight,treat)
aov <- aov(data_xy$weight ~ data_xy$treat, data = data_xy)
# Summary of the analysis
summary(aov)



##=============== Quiz: Hypothesis Testing [Two Population] ====================

## Quiz 01
# จากการประเมินผลของโปรแกรมควบคุมน้ำหนัก A และ B ในประชากร พบว่า
# ส่วนเบี่ยงเบนมาตรฐานของน้ำหนักที่ลดลงของโปรแกรม A และโปรแกรม B 
# เท่ากับ 1.5 และ 2 กิโลกรัม ตามลำดับ ถ้าทำการสุ่มตัวอย่างกลุ่มที่เข้าร่วมโปรแกรม A 
# และ B กลุ่มละ 30 คน ได้ข้อมูลดังนี้ กลุ่ม A ค่าเฉลี่ยของน้ำหนักที่ลดลง 2.5 กิโลกรัม 
# กลุ่ม B ค่าเฉลี่ยของน้ำหนักที่ลดลง 2.8 กิโลกรัม จากข้อมูลสามารถสรุปได้หรือไม่ว่า 
# น้ำหนักเฉลี่ยที่ลดลง ทั้ง 2 กลุ่มแตกต่างกันที่ระดับนัยสำคัญ 0.05

z.test(2.5-2.8,mu=0,sd=sqrt(1.5^2/30+2^2/30),alternative = "two.sided",conf.level = 0.95)


## Quiz 02
# นักวิจัยผู้หนึ่งต้องการเปรียบเทียบระยะเวลาที่ใช้ในการรักษาตัวอย่างผู้ป่วย
# รายคน (นาที) ของแพทย์เฉพาะทาง 2 แผนก ในโรงพยาบาลแห่งหนึ่ง พบว่า
# แผนกที่ 1 ใช้เวลาเฉลี่ย 10.79 นาที และความแปรปรวน 1.86 นาที^2 จากตัวอย่าง
# 11 คน โดยแผนกที่ 2 ใช้เวลาเฉลี่ย 11.75 นาที และความแปรปรวน 2.61 นาที^2 
# จากตัวอย่าง 10 คน ถ้าระยะเวลาที่ใช้ในการรักษาของ 2 แผนกมีการแจกแจง
# แบบปกติโดยประมาณและความแปรปรวนของระยะเวลาที่ใช้ในการรักษาในประชากร
# ไม่แตกต่างกัน จากข้อมูลสรุปได้หรือไม่ว่าระยะเวลาที่ใช้ในการรักษาของแพทย์
# เฉพาะทาง 2 แผนก แตกต่างกันที่ระดับนัยสำคัญ 0.05

# t-test equal variance
G1<-c(10.5,12.5,9.0,10.75,10.0,12.0,11.0,13.5,10.0,9.5,10.0)
mean(G1)
sd(G1)^2
G2<-c(12.5,9.5,13.5,13.75,12,10.75,10.5,9.5,12.0,13.5)
mean(G2)
sd(G2)^2
var.test(G1,G2,conf.level=0.95)
t.test(G1,G2,var.equal = TRUE,alternative = "two.sided",conf.level = 0.95)
pt(-2.73,df=19,lower.tail = TRUE)*2
pt(2.73,df=19,lower.tail = TRUE)


## Quiz 03
# ในการศึกษาประสิทธิภาพของโปรแกรมการให้ความรู้เรื่องพิษภัยของบุหรี่
# โดยพิจารณาจากคะแนนความรู้ของผู้เข้าร่วมโปรแกรม (0-100 คะแนน) 
# สุ่มตัวอย่างผู้เข้าร่วมโปรแกรม จำนวน 12 คน และทำแบบทดสอบความรู้ก่อน-หลัง
# ซึ่งคะแนนมีการแจกแจงแบบปกติ โดยมีค่าส่วนเบี่ยงเบนมาตรฐานของผลต่างของ
# ความรู้ก่อน-หลังที่ 26.05 คะแนน ได้ข้อมูลดังตารางต่อไปนี้..

# จากข้อมูลสรุปได้หรือไม่ว่าโปรแกรมการให้ความรู้เรื่องพิษภัยของบุหรี่
# ทำให้ผู้เข้าร่วมโปรแกรมมีความรู้เพิ่มขึ้นที่ระดับนัยสำคัญ 0.05


# paired t-test
before<-c(25,62,56.0,9.2,3.1,50.0,33.0,69.0,64.0,18.8,10,34.0)
after<-c(64	,90,	59,	37.8,	10.1,	19.6,	41,	87.8,	86,	55,	88,	40)
d<-after-before
d_bar<-sum(d)/12
d_bar
sd(d)
sd(d)^2
t.test(after,before,paired = TRUE, alternative ="greater",conf.level = 0.95 )


## Quiz 04
# ตารางต่อไปนี้แสดงจำนวนนักเรียนชายและหญิงจากกลุ่มตัวอย่าง อายุ 6-12 ปี
# เพื่อศึกษาเกี่ยวกับภาวะทุพโภชนาการของเด็กในวัยเรียน 

# จากตารางสรุปได้หรือไม่ว่าภาวะทุพโภชนาการของเด็กวัยเรียนในกลุ่มเด็กผู้ชาย
# สูงกว่าในเด็กผู้หญิง ที่ระดับนัยสำคัญ 0.05

prop.test(x=c(80,45),n=c(320,250),alternative = "greater",conf.level = 0.95,correct = "FALSE")
z<-sqrt(4.0169)
z


## Quiz 05
# ผู้ผลิตเครื่องมือแพทย์ต้องการทดสอบความคงทนของแบตเตอรี่ที่ใช้ใน
# เครื่องวัดความดันโลหิตของเครื่องรุ่นใหม่กับเครื่องรุ่นเดิมผู้ผลิตเครื่องมือแพทย์
# ทำการวัดอายุของแบตเตอรี่ของเครื่องวัดความดันโลหิตทั้ง 2 รุ่น พบว่า
# มีอายุของแบตเตอรี่ (สัปดาห์) มีการแจกแจงแบบปกติ โดยเครื่องรุ่นเก่า
# มีความแปรปรวนที่ 7.2545 สัปดาห์^2 และเครื่องรุ่นใหม่มีความแปรปรวน
# ที่ 9.3292 สัปดาห์^2 ดังรายละเอียดต่อไปนี้ จากข้อมูลดังกล่าวสรุปได้หรือไม่ว่า 
# ความแปรปรวนของอายุแบตเตอรี่ของเครื่องวัดความดันโลหิตของรุ่นใหม่
# มากกว่ารุ่นเก่าที่ระดับนัยสำคัญ 0.05

# F-test
new<-c(10,	14,	16,	13,	13,	17,	20,	21,	19,	19,	17,	16,	16,	16,	17,	21)
sd(new)^2
old<-c(7,	9,	10,	12,	13,	10,	8	,7	,6	,5,	5)
sd(old)^2

var.test(new,old,alternative = "greater",conf.level = 0.95)
qf(0.05, df1=15, df2=10, lower.tail = FALSE)
qf(0.95, df1=15, df2=10, lower.tail = FALSE)


