#===============================================================
#                CHHD301-Biostatistics
#===============================================================
# INSTRUCTOR : Dr. Wiriya Mahikul
# TITLE      : Lecture 10 - Hypothesis Testing [One Population]
#===============================================================


library(TeachingDemos)
library(DescTools)


##============================ Tests for One Population Mean ============================

## หน้า 28
# ระดับคะแนนความรู้ด้านการป้องกันโรคท้องร่วงของประชาชนในชุมชนแห่งหนึ่ง
# มีการแจกแจงโดยประมาณแบบปกติ ด้วยส่วนเบี่ยงเบนมาตรฐาน 15 คะแนน 
# ถ้าเลือกสุ่มประชาชนในชุมชนนี้มา 25  คน แล้ววัดคะแนนความรู้พบว่าคะแนน
# ความรู้เฉลี่ยได้ 75 คะแนน จากข้อมูลที่เก็บมานี้สรุปได้หรือไม่ว่า คะแนนความรู้
# ด้านการป้องกันโรคท้องร่วงเฉลี่ยของคนในชุมชนนี้แตกต่างไปจาก 70 คะแนน 
# ด้วยความน่าจะเป็นของการเกิดความผิดพลาดชนิดที่ 1 คือ 5%

qnorm(0.025)
qnorm(0.975)

pnorm(1.96)
pnorm(1.67)
1-pnorm(1.67)
pnorm(-1.67)

#p-value
pnorm(-1.6667)*2

# อีกแบบ
z.test(75,mu=70,sd=15,alternative = "two.sided",conf.level = 0.95,n=25)


## หน้า 31
# สมมติว่า เวลาเฉลี่ยของการตรวจเชื้อแบคทีเรียด้วยวิธีมาตรฐานมีการแจกแจงโดยประมาณแบบปกติ 
# คือ 50 วินาทีและส่วนเบี่ยงเบนมาตรฐานเท่ากัน 11.9 วินาที โดยวิธีใหม่ในการใช้ตรวจตัวอย่าง 12 ตัวอย่าง 
# ใช้เวลาเฉลี่ย 42 วินาที สามารถสรุปได้หรือไม่ว่าวิธีการใหม่สามารถตรวจวัดเชื้อแบคทีเรียได้เร็วกว่า
# วิธีมาตรฐานหรือไม่ ที่ระดับนัยสําคัญ 0.05

qnorm(0.05)

#p-value
pnorm(-2.3288,lower.tail = TRUE)

qt(0.025,15)
qt(0.975,15)

pt(-1.1429,15)*2

# อีกแบบ
z.test(42,mu=50,sd=11.9,alternative = "less",conf.level = 0.95,n=12)


## หน้า 34
# ระดับอะไมเลสในเลือด (Serum amylase) ของตัวอย่างผู้ป่วยเบาหวาน 16 คน 
# มีค่าเฉลี่ยอยู่ที่ 110 units/ 100 ml และส่วนเบี่ยงเบนมาตรฐาน 35 units/ 100 ml สรุปได้
# หรือไม่ว่าค่าเฉลี่ยของระดับอะไมเลสในเลือดต่างไปจากค่ามาตรฐานที่ 120 units/ 100 ml 
# ที่ระดับนัยสําคัญ 0.05


pt(-1.1429,15)
pt(-1.1429,15)*2
pt(1.1429,15)
qt(0.025,15)
qt(0.025,15,lower.tail = FALSE)
t.test<-(110-120)/(35/sqrt(16))
t.test

# อีกแบบ
z.test(110,mu=120,sd=35,alternative = "two.sided",conf.level = 0.95,n=16)


##============================ Tests for One Population Proportion ============================

## หน้า 39
# นักวิจัยได้สอบถามความพึงพอใจของผู้รับบริการทางสุขภาพที่ โรงพยาบาลศูนย์แห่งหนึ่ง
# พบว่า ผู้รับบริการจํานวน 500 คน มีผู้ตอบว่าพึงพอใจต่อระยะเวลาในการรอคอย เพียง 24 คน
# ไม่พึ่งพอใจ 476 คน จากข้อมูลสรุปได้หร ือไม่ว่า สัดส่วนของผู้ตอบแบบสอบถามมีความไม่พึงพอใจ
# ต่อระยะเวลารอคอยแตกต่างไปจาก 95% ที่ระดับนัยสําคัญ 0.01

qnorm(0.995)
qnorm(0.005)
pnorm(-0.2052)*2
pnorm(-0.2052)
pnorm(0.2052)

prop.test(476,500,p=0.95,alternative = "two.sided",conf.level = 0.99,correct = FALSE)
sqrt(0.042105)
pnorm(sqrt(0.042105),lower.tail = FALSE)*2


## หน้า 42
# การศึกษาสัดส่วนการแท้งในช่วงไตรมาสแรก (3 เดือนแรก) ของการตั้งครรภ์
# ในสตรีในเขตชนบท โดยสุ่มเลือกสตรีที่เคยมาฝากครรภ์ที่โรงพยาบาลในพื้นที่ดังกล่าว 
# จำนวน 2,428 คน พบว่ามีการแท้งในช่วงไตรมาสแรก จำนวน 461 คน จากข้อมูลดังกล่าว
# สรุปได้หรือไม่ว่า สัดส่วนการแท้งในช่วงไตรมาสแรกของสตรีในเขตชนบท มากกว่า
# ร้อยละ 15 ที่ระดับนัยสำคัญ 0.1

prop.test(461,2428,p=0.15,alternative = "greater",conf.level = 0.9,correct = FALSE)
sqrt(30.269)


##============================ Tests for One Population Variance ============================

## หน้า 47
# จากการศึกษาเกี่ยวกับอายุของคนที่เป็นโรค SLE ณ วันที่ตรวจพบโรคครั้งแรก 
# จำนวน 17 คน มีความแปรปรวนของอายุ 25.9 ปี และมีการแจกแจงแบบปกติ 
# จากข้อมูลดังกล่าาสรุปได้หรือไม่ว่า ความแปรปรวนของอายคนไข้โรค SLE 
# แตกต่างไปจาก 20 ปีที่ระดับนัยสำคัญ 0.01

pchisq(20.72, df=16, ncp = 0, lower.tail = FALSE)*2


#Example
VarTest(c(31,26,21,15,26,16,19,21,28,27,22,20,25,31,20,25,15),sigma.squared = 20,alternative = "two.sided",conf.level = 0.99)


##=============== Quiz: Hypothesis Testing [One Population] ====================

## Quiz 01
# ระดับคะแนนความรู้ด้านการป้องกันโรคท้องร่วงของประชาชนในชุมชนแห่งหนึ่ง
# มีการแจกแจงโดยประมาณแบบปกติ ด้วยส่วนเบี่ยงเบนมาตรฐาน 15 คะแนน 
# ถ้าเลือกสุ่มประชาชนในชุมชนนี้มา 45 คน แล้ววัดคะแนนความรู้ พบว่าคะแนน
# ความรู้เฉลี่ยได้ 75 คะแนน จากข้อมูลที่เก็บมานี้สรุปได้หรือไม่ว่า 
# คะแนนความรู้ด้านการป้องกันโรคท้องร่วงเฉลี่ยของคนในชุมชนนี้แตกต่างไป
# จาก 70 คะแนน ด้วยความน่าจะเป็นของการเกิดความผิดพลาดชนิดที่ 1 คือ 1%

z.test(75,mu=70,sd=15,alternative = "two.sided",conf.level = 0.99,n=45)


## Quiz 02
# สมมติว่า เวลาเฉลี่ยของการตรวจเชื้อแบคทีเรียด้วยวิธีมาตรฐานมี
# การแจกแจงโดยประมาณแบบปกติ คือ 43 วินาที และส่วนเบี่ยงเบนมาตรฐาน
# เท่ากับ 11.9 วินาที โดยวิธีใหม่ในการใช้ตรวจตัวอย่าง 32 ตัวอย่าง ใช้เวลาเฉลี่ย
# 42 วินาที สามารถสรุปได้หรือไม่ว่าวิธีการใหม่สามารถตรวจวัดเชื้อแบคทีเรียได้
# เร็วกว่าวิธีมาตรฐานหรือไม่ ที่ระดับนัยสำคัญ 0.01

z.test(42,mu=43,sd=11.9,alternative = "less",conf.level = 0.99,n=32)


## Quiz 03
# ระดับอะไมเลสในเลือด (Serum amylase) ของตัวอย่างผู้ป่วยเบาหวาน 32 คน 
# มีค่าเฉลี่ยอยู่ที่ 110 units/ 100 ml และส่วนเบี่ยงเบนมาตรฐาน 35 units/ 100 ml
# สรุปได้หรือไม่ว่าค่าเฉลี่ยของระดับอะไมเลสในเลือดต่างไปจากค่ามาตรฐานที่ 
# 120 units/ 100 ml ที่ระดับนัยสำคัญ 0.01

qt(0.025,15)
qt(0.025,15,lower.tail = FALSE)
t.test<-(110-120)/(35/sqrt(32))
t.test
z.test(110,mu=120,sd=35,alternative = "two.sided",conf.level = 0.99,n=32)


## Quiz 04
# นักวิจัยได้สอบถามความพึงพอใจของผู้รับบริการทางสุขภาพที่ 
# โรงพยาบาลศูนย์แห่งหนึ่ง พบว่า ผู้รับบริการจำนวน 500 คน มีผู้ตอบว่า
# พึงพอใจต่อระยะเวลาในการรอคอย เพียง 40 คน ไม่พึ่งพอใจ 460 คน 
# จากข้อมูลสรุปได้หรือไม่ว่า สัดส่วนของผู้ตอบแบบสอบถามมีความไม่พึงพอใจ
# ต่อระยะเวลารอคอยแตกต่างไปจาก 95% ที่ระดับนัยสำคัญ 0.05

prop.test(460,500,p=0.95,alternative = "two.sided",conf.level = 0.95,correct = FALSE)
sqrt(9.4737)
pnorm(-5.38)


## Quiz 05
# การศึกษาสัดส่วนการแท้งในช่วงไตรมาสแรก (3 เดือนแรก) 
# ของการตั้งครรภ์ในสตรีในเขตชนบท โดยสุ่มเลือกสตรีที่เคยมาฝากครรภ์
# ที่โรงพยาบาลในพื้นที่ดังกล่าว จำนวน 2,400 คน พบว่ามีการแท้งในช่วง
# ไตรมาสแรก จำนวน 300 คน จากข้อมูลดังกล่าวสรุปได้หรือไม่ว่า สัดส่วน
# การแท้งในช่วงไตรมาสแรกของสตรีในเขตชนบท น้อยกว่าร้อยละ 15 
# ที่ระดับนัยสำคัญ 0.05

prop.test(300,2400,0.15,alternative = "greater",conf.level = 0.95,correct = FALSE)
