#===============================================================
#                CHHD301-Biostatistics
#===============================================================
# INSTRUCTOR : Dr. Wiriya Mahikul
# TITLE      : Lecture 7 - Estimation 
#===============================================================



# Children's IQ scores are normally distributed with a
# mean of 100 and a standard deviation of 15. What
# proportion of children are expected to have an IQ between
# 80 and 120?

mean=100; sd=15
lb=80; ub=120

x <- seq(-4,4,length=100)*sd + mean
hx <- dnorm(x,mean,sd)

plot(x, hx, type="n", xlab="IQ Values", ylab="",
     main="Normal Distribution", axes=FALSE)

i <- x >= lb & x <= ub
lines(x, hx)
polygon(c(lb,x[i],ub), c(0,hx[i],0), col="red")

area <- pnorm(ub, mean, sd) - pnorm(lb, mean, sd)
result <- paste("P(",lb,"< IQ <",ub,") =",
                signif(area, digits=3))
mtext(result,3)
axis(1, at=seq(40, 160, 20), pos=0)


##=============== Confidence Interval For a Population Mean ====================


## หน้า 15
# นักกายภาพบําบัดคนหนึ่งต้องการที่จะหาค่าเฉลี่ยของความแข็งแรงกล้ามเนื้อในคนไข้กลุ่มหนึ่ง
# จึงได้ทําการสุ่มเก็บรวบรวมข้อมูลจากคนไข้อาสาสมัคร 15 คน ได้ค่าเฉลี่ยความแข็งแรงของกล้ามเนื้อเท่ากับ 84.3 ปอนด์ 
# ความแปรปรวน 139.24 ปอนด์^2 ถ้าทราบความแข็งแรงของกล้ามเนื้อมีการแจกแจงโดยประมาณแบบปกติด้วยความแปรปรวน 144 ปอนด์^2

# จงสร้างช่วงความเชื่อมั่น 99% ของค่าเฉลี่ยความแข็งแรงของกล้ามเนื้อคนไข้
84.3-qnorm(.995)*(12/sqrt(15))
84.3+qnorm(.995)*(12/sqrt(15))


## หน้า 18
# ทีมนักวิจัยจากสถาบันการศึกษาแห่งหนึ่งต้องการที่จะศึกษาเกี่ยวกับการตรงต่อเวลา
# ของคนไข้ที่นัดพบแพทย์ในโรงพยาบาลแห่งหนึ่ง จึงได้สอบถามคนไข้ที่มาพบแพทย์
# ในโรงพยาบาลแห่งนี้จํานวน 60 คน พบว่าผิดนัดกับแพทย์ด้วยเวลาเฉลี่ย 17.2 นาที
# ส่วนเบี่ยงเบนมาตรฐาน 4 นาทีจากข้อมูลในอดีตพบว่าความแปรปรวนของ
# เวลาที่คนไข้ผิดนัดกับแพทย์ที่ตรวจรักษาเป็น 64 นาที^2

# จงสร้างช่วงความเชื่อมั่น 90% ของเวลาเฉลี่ยที่คนไข้จะผิดนัดกับแพทย์ที่ตรวจรักษา
17.2-qnorm(.95)*(8/sqrt(60))
17.2+qnorm(.95)*(8/sqrt(60))



## หน้า 21
# ถ้าเลือกตัวอย่างเด็กหญิงอายุ10 ขวบมา 16 คน ได้ค่าเฉลี่ยและส่วนเบี่ยงเบนมาตรฐาน
# ของน้ำหนักเป็น 71.5 ปอนด์และ 12 ปอนด์ตามลําดับ ถ้าน้ำหนักเด็กหญิงกลุ่มนี้มีการแจกแจงปกติ

# จงสร้างช่วงความเชื่อมั่น 95% ของ น้ำหนักเฉลี่ยเด็กหญิงกลุ่มนี้
71.5-qt(0.025, 15, lower.tail = FALSE)*(12/sqrt(16))
71.5+qt(0.025, 15, lower.tail = FALSE)*(12/sqrt(16))



##=============== Confidence Interval For a Population proportion ====================

## หน้า 26
# จากรายงานของกระทรวงเทคโนโลยีและสารสนเทศปีพ.ศ. 2560 ระบุว่าในกลุ่ม
# ผู้ใช้อินเตอร์เน็ตจํานวน 1,220 คน พบว่า 220 คนใช้อินเตอร์เน็ตเพื่อความบันเทิง

# จงสร้างช่วงความเชื่อมั่น 95% ของสัดส่วนผู้ใช้อินเตอร์เน็ต เพื่อความบันเทิงในปีพ.ศ. 2560
220/1220-qnorm(.975)*(sqrt(0.18*0.82/1220))
220/1220+qnorm(.975)*(sqrt(0.18*0.82/1220))



##=============== Confidence Interval for the Variance ====================
## หน้า 30
# ในการตรวจหาปริมาณฮีโมโกลบินในสัตว์ทดลอง 16 ตัว พบว่ามีความแปรปรวนของปริมาณ
# ฮีโมโกลบินในสัตว์ทดลอง 2.18 กรัมต่อเดซิลิตร^2 จงสร้างช่วงความเชื่อมั่น 95% ของความ
# แปรปรวนของปริมาณฮีโมโกลบินในสัตว์ทดลอง
15*2.18/qchisq(0.975, df=15, ncp = 0, lower.tail = TRUE)
15*2.18/qchisq(0.025, df=15, ncp = 0, lower.tail = TRUE)



##=============== Confidence Interval For two difference means ====================
## หน้า 36 (เนื่องจากโจทย์มีตารางด้วย เลยไม่ได้แปะโจทย์)
(20.6-17.4)-qnorm(.995)*(sqrt(33.64/185+33.64/86))
(20.6-17.4)+qnorm(.995)*(sqrt(33.64/185+33.64/86))



##=============== Quiz: Estimation  ====================

## Quiz 01
# นักกายภาพบำบัดคนหนึ่งต้องการที่จะหาค่าเฉลี่ยของความแข็งแรงกล้ามเนื้อในคนไข้กลุ่มหนึ่ง
# จึงได้ทำการสุ่มเก็บรวบรวมข้อมูลจากคนไข้อาสาสมัคร 20 คน ได้ค่าเฉลี่ยความแข็งแรงของกล้ามเนื้อเท่ากับ 82.3 ปอนด์
# ความแปรปรวน 139.24 ปอนด์^2 ถ้าทราบความแข็งแรงของกล้ามเนื้อมีการแจกแจงโดยประมาณแบบปกติด้วยความแปรปรวน 144 ปอนด์^2
# ข้อใดคือ ช่วงความเชื่อมั่น 99% ของค่าเฉลี่ยความแข็งแรงของกล้ามเนื้อคนไข้
82.3-qnorm(.995)*(12/sqrt(20))
82.3+qnorm(.995)*(12/sqrt(20))


## Quiz 02
# ถ้าเลือกตัวอย่างเด็กหญิงอายุ 10 ขวบมา 15 คน ได้ค่าเฉลี่ยและส่วนเบี่ยงเบนมาตรฐาน
# ของน้ำหนักเป็น 72.5 ปอนด์และ 12 ปอนด์ตามลำดับ ถ้าน้ำหนักเด็กหญิงกลุ่มนี้มีการแจกแจงปกติ 
# ข้อใดคือ ช่วงความเชื่อมั่น 95% ของน้ำหนักเฉลี่ยเด็กหญิงกลุ่มนี้
72.5-qt(0.025, 15, lower.tail = FALSE)*(12/sqrt(15))
72.5+qt(0.025, 15, lower.tail = FALSE)*(12/sqrt(15))


## Quiz 03
# จากรายงานของกระทรวงเทคโนโลยีและสารสนเทศปี พ.ศ. 2560 ระบุว่าในกลุ่มผู้ใช้อินเตอร์เน็ตจำนวน
# 1,200 คน พบว่า 250 คนใช้อินเตอร์เน็ตเพื่อความบันเทิง ข้อใดคือ ช่วงความเชื่อมั่น 95% ของสัดส่วน
# ผู้ใช้อินเตอร์เน็ต เพื่อความบันเทิงในปี พ.ศ. 2560
250/1200-qnorm(.975)*(sqrt(0.21*0.79/1200))
250/1200+qnorm(.975)*(sqrt(0.21*0.79/1200))


## Quiz 04 (เนื่องจากโจทย์มีตารางด้วย เลยไม่ได้แปะโจทย์)
##90%
sp<-((10*1.05^2)+(7*1.01^2))/(11+8-2)
sp
(11.21-10.00)-qt(0.05, df=17, lower.tail = FALSE)*(sqrt(sp/11+sp/8))
(11.21-10.00)+qt(0.05, df=17, lower.tail = FALSE)*(sqrt(sp/11+sp/8))


## Quiz 05 (เนื่องจากโจทย์มีตารางด้วย เลยไม่ได้แปะโจทย์)
##90%
(25/220-42/300)-qnorm(.95)*(sqrt(0.114*0.886/220+0.14*0.86/300))
(25/220-42/300)+qnorm(.95)*(sqrt(0.114*0.886/220+0.14*0.86/300))




